In [1]:
import numpy as np
import pandas as pd

In [6]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [7]:
df=pd.DataFrame(d)

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna()# remove rows with value nan

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1)# coumns of null value

   C
0  1
1  2
2  3

In [12]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [13]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [14]:
df.fillna(value= 'hey love')

          A         B  C
0       1.0       5.0  1
1       2.0  hey love  2
2  hey love  hey love  3

In [15]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [16]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64